toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
static void _MSPRead(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPRead;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    
    // Start the USB DataIn task
    _TaskUSBDataIn::Start();
    
    uint32_t addr = arg.addr;
    uint32_t len = arg.len;
    while (len) {
        _Scheduler::Wait([] { return !_Bufs.full(); });
        
        auto& buf = _Bufs.back();
        // Prepare to receive either `len` bytes or the
        // buffer capacity bytes, whichever is smaller.
        const size_t chunkLen = std::min((size_t)len, sizeof(buf.data));
        _MSP.read(addr, buf.data, chunkLen);
        addr += chunkLen;
        len -= chunkLen;
        // Enqueue the buffer
        buf.len = chunkLen;
        _Bufs.push();
    }
    
    // Wait for DataIn task to complete
    _Scheduler::Wait([] { return _Bufs.empty(); });
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPWrite(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPWrite;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    _MSP.crcReset();
    
    uint32_t addr = arg.addr;
    uint32_t len = arg.len;
    
    // Trigger the USB DataOut task with the amount of data
    _TaskUSBDataOut::Start(len);
    
    while (len) {
        _Scheduler::Wait([] { return !_Bufs.empty(); });
        
        // Write the data over Spy-bi-wire
        auto& buf = _Bufs.front();
        _MSP.write(addr, buf.data, buf.len);
        // Update the MSP430 address to write to
        addr += buf.len;
        len -= buf.len;
        // Pop the buffer, which we just finished sending over Spy-bi-wire
        _Bufs.pop();
    }
    
    // Verify the CRC of all the data we wrote
    const auto r = _MSP.crcVerify();
    // Send status
    _System::USBSendStatus(r == _MSP.Status::OK);
}

struct _MSPDebugState {
    uint8_t bits = 0;
    uint8_t bitsLen = 0;
    size_t len = 0;
    bool ok = true;
};

static void _MSPDebugPushReadBits(_MSPDebugState& state, _BufQueue::Buf& buf) {
    if (state.len >= sizeof(buf.data)) {
        state.ok = false;
        return;
    }
    
    // Enqueue the new byte into `buf`
    buf.data[state.len] = state.bits;
    state.len++;
    // Reset our bits
    state.bits = 0;
    state.bitsLen = 0;
}

static void _MSPDebugHandleSBWIO(const MSPDebugCmd& cmd, _MSPDebugState& state, _BufQueue::Buf& buf) {
    const bool tdo = _MSP.debugSBWIO(cmd.tmsGet(), cmd.tclkGet(), cmd.tdiGet());
    if (cmd.tdoReadGet()) {
        // Enqueue a new bit
        state.bits <<= 1;
        state.bits |= tdo;
        state.bitsLen++;
        
        // Enqueue the byte if it's filled
        if (state.bitsLen == 8) {
            _MSPDebugPushReadBits(state, buf);
        }
    }
}

static void _MSPDebugHandleCmd(const MSPDebugCmd& cmd, _MSPDebugState& state, _BufQueue::Buf& buf) {
    switch (cmd.opGet()) {
    case MSPDebugCmd::Ops::TestSet:     _MSP.debugTestSet(cmd.pinValGet());     break;
    case MSPDebugCmd::Ops::RstSet:      _MSP.debugRstSet(cmd.pinValGet()); 	    break;
    case MSPDebugCmd::Ops::TestPulse:   _MSP.debugTestPulse(); 				    break;
    case MSPDebugCmd::Ops::SBWIO:       _MSPDebugHandleSBWIO(cmd, state, buf);	break;
    default:                            abort();
    }
}

static void _MSPDebug(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPDebug;
    
    // Bail if more data was requested than the size of our buffer
    if (arg.respLen > sizeof(_BufQueue::Buf::data)) {
        // Reject command
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    auto& bufIn = _Bufs.back();
    _Bufs.push();
    auto& bufOut = _Bufs.back();
    
    _MSPDebugState state;
    
    // Handle debug commands
    {
        size_t cmdsLenRem = arg.cmdsLen;
        while (cmdsLenRem) {
            // Receive debug commands into buf
            _USB.recv(Endpoints::DataOut, bufIn.data, sizeof(bufIn.data));
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
            
            // Handle each MSPDebugCmd
            const MSPDebugCmd* cmds = (MSPDebugCmd*)bufIn.data;
            const size_t cmdsLen = _USB.recvLen(Endpoints::DataOut) / sizeof(MSPDebugCmd);
            for (size_t i=0; i<cmdsLen && state.ok; i++) {
                _MSPDebugHandleCmd(cmds[i], state, bufOut);
            }
            
            cmdsLenRem -= cmdsLen;
        }
    }
    
    // Reply with data generated from debug commands
    {
        // Push outstanding bits into the buffer
        // This is necessary for when the client reads a number of bits
        // that didn't fall on a byte boundary.
        if (state.bitsLen) _MSPDebugPushReadBits(state, bufOut);
        
        if (arg.respLen) {
            // Send the data and wait for it to be received
            _USB.send(Endpoints::DataIn, bufOut.data, arg.respLen);
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
        }
    }
    
    // Send status
    _System::USBSendStatus(state.ok);
}

void _SDInit(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPISetConfig(_QSPIConfigs.ICEApp);
    
    _SD::Disable();
    _SD::Enable();
    
    _System::USBSendStatus(true);
    
    // Send SD card info
    alignas(4) const SDCardInfo cardInfo = {
        .cardId = _SD::CardId(),
        .cardData = _SD::CardData(),
    };
    
    _USB.send(Endpoints::DataIn, &cardInfo, sizeof(cardInfo));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
}

static void _SDRead(const STM::Cmd& cmd) {
    static bool reading = false;
    const auto& arg = cmd.arg.SDRead;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPISetConfig(_QSPIConfigs.ICEApp);
    
